app/mailers/user_mailer.rb

  def info_email(user)
    @user = user
    @type = Recomendation.find_by_type_cancer(user.register.cancer_type)
---
SELECT  "recomendations".* FROM "recomendations" WHERE "recomendations"."type_cancer" = $1 LIMIT $2  [["type_cancer", "tipo02"], ["LIMIT", 1]]