app/views/users/show.html.erb

SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  <div class="col-md-8">
    <% if @user.posts.any? %>