app/controllers/depoimentos_controller.rb

SELECT "depoimentos".* FROM "depoimentos"
---
  def index
    @depoimentos = Depoimento.all

DELETE FROM "depoimentos" WHERE "depoimentos"."id" = ?  [["id", 980190962]]
---
  def destroy
    @depoimento.destroy

SELECT  "depoimentos".* FROM "depoimentos" WHERE "depoimentos"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_depoimento
      @depoimento = Depoimento.find(params[:id])