app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "sadfasd"], ["user_id", 1], ["created_at", "2018-06-09 20:35:21.947781"], ["updated_at", "2018-06-09 20:35:21.947781"]]