app/controllers/registers_controller.rb

  def create
    @register = current_user.build_register(register_params)
    if @register.save
---
INSERT INTO "registers" ("user_id", "blood_type", "cancer_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["blood_type", "B+"], ["cancer_type", "tipo02"], ["created_at", "2018-06-27 00:03:00.991714"], ["updated_at", "2018-06-27 00:03:00.991714"]]