app/controllers/usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios"
---
  def index
    @usuarios = Usuario.all

INSERT INTO "usuarios" ("nome", "idade", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "MyString"], ["idade", 1], ["created_at", "2018-04-30 01:35:22.965108"], ["updated_at", "2018-04-30 01:35:22.965108"]]
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 980190962]]
---
  def destroy
    @usuario.destroy

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_usuario
      @usuario = Usuario.find(params[:id])